[
  {
    "update_title": "OBody NG PDA Assistance Beta tester release",
    "version": "2.9.0",
    "update_type": "hard",
    "description": "First public release of OBody NG PDA Assistance, which was in development for 3 months.",
    "details": {
      "date": "2025-12-19",
      "changes": [
        "- Base version of the project, with almost all functions included",
        "- Tested by beta testers, in different languages",
        "- Aspects such as it not yet being compatible with Linux will be reviewed; next year it will be compatible"
      ]
    }
  },
  {
    "update_title": "OBody NG PDA Assistance Beta tester release FIX 1",
    "version": "2.9.5",
    "update_type": "hard",
    "description": "After multiple observations made by the beta testers, all found issues have been corrected.",
    "details": {
      "date": "2025-12-22",
      "changes": [
        "- Fixed issues with the log directory path in documents; logs generated by SKSE now correctly show in 📃 Log Viewer",
        "- Dependency review for rule creation and management; in summary, outdated beta PowerShell scripts that served as a bridge for creating and managing .ini rules were removed, as they are now obsolete, and everything is done from the master .pyw file. Only 3 .ps1 scripts are kept: one for reboots, one as a bridge between C++ and Python, and lastly the bridge for standalone desktop mode.",
        "- Performance improvement in frontier loading; now, when loading HTML, it doesn't load the news page unless desired, which helps with much faster loading and works perfectly without internet, as the connection to the news pages is completely optional.",
        "- Improvement in faction acquisition, and incorporation of faction lists manually obtained from the base game, as a read file.",
        "- Port Configuration improvement to choose desired ports but with observation if a port is already in use.",
        "- Improved font size for better readability without having to increase or decrease page size.",
        "- Configuration backup optimization for new updates and keeping everything organized.",
        "- News tab improvement."
      ]
    }
  },
  {
    "update_title": "OBody NG PDA Assistance Beta tester release FIX 2",
    "version": "2.9.7",
    "update_type": "hard",
    "description": "Final migration of internal processes to Python, completely eliminating dependencies on external scripts for core logic.",
    "details": {
      "date": "2025-12-24",
      "changes": [
        "- Full independence from .ps1 scripts, all internal processes are now handled natively within the Python environment",
        "- Improved stability and execution speed by removing the overhead of calling external PowerShell processes",
        "- Optimized internal bridge logic to ensure seamless communication between components without third-party script reliance"
      ]
    }
  }
]